In [7]:
import pandas as pd
import numpy as np

In [8]:
alcohols = pd.read_csv('world_alcohol.csv')
print(alcohols)

   Year       WHO region          Country Beverage Types  Display Value
0  1986  Western Pacific         Viet Nam           Wine           0.00
1  1986         Americas          Uruguay          Other           0.50
2  1985           Africa     Cet d'Ivoire           Wine           1.62
3  1986         Americas         Columbia           Beer           4.27
4  1987         Americas  Saint Kitts and           Beer           1.98

In [9]:
alcohols.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Year</th>
      <th>WHO region</th>
      <th>Country</th>
      <th>Beverage Types</th>
      <th>Display Value</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1986</td>
      <td>Western Pacific</td>
      <td>Viet Nam</td>
      <td>Wine</td>
      <td>0.00</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1986</td>
      <td>Americas</td>
      <td>Uruguay</td>
      <td>Other</td>
      <td>0.50</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1985</td>
      <td>Africa</td>
      <td>Cet d'Ivoire</td>
      <td>Wine</td>
      <td>1.62</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1986</td>
      <td>Americas</td>
      <td>Columbia</td>
      <td>Beer</td>
      <td>4.27</td>
    </tr>
    <tr>
      <th>4</th>
      <td>1987</td>
      <td>Americas</td>
      <td>Saint Kitts and</td>
      <td>Beer</td>
      <td>1.98</td>
    </tr>
  </tbody>
</table>
</div>

In [10]:
alcohols.loc[1:4]

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Year</th>
      <th>WHO region</th>
      <th>Country</th>
      <th>Beverage Types</th>
      <th>Display Value</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>1</th>
      <td>1986</td>
      <td>Americas</td>
      <td>Uruguay</td>
      <td>Other</td>
      <td>0.50</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1985</td>
      <td>Africa</td>
      <td>Cet d'Ivoire</td>
      <td>Wine</td>
      <td>1.62</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1986</td>
      <td>Americas</td>
      <td>Columbia</td>
      <td>Beer</td>
      <td>4.27</td>
    </tr>
    <tr>
      <th>4</th>
      <td>1987</td>
      <td>Americas</td>
      <td>Saint Kitts and</td>
      <td>Beer</td>
      <td>1.98</td>
    </tr>
  </tbody>
</table>
</div>

In [11]:
alcohols['Year']

0    1986
1    1986
2    1985
3    1986
4    1987
Name: Year, dtype: int64

In [12]:
alcohols.Year

0    1986
1    1986
2    1985
3    1986
4    1987
Name: Year, dtype: int64

# Multi-index

In [13]:
populations = [123, 124, 125, 126, 127, 128]
index = pd.MultiIndex.from_tuples([('China', 2000), ('China', 2001), ('US', 2000), ('US', 2001), ('Canada', 2001), ('Canada', 2004)])
pop = pd.Series(populations, index=index)
pop

China   2000    123
        2001    124
US      2000    125
        2001    126
Canada  2001    127
        2004    128
dtype: int64

In [14]:
df = pd.DataFrame(np.random.rand(4, 2), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], columns=['data1', 'data2'])
df

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>data1</th>
      <th>data2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="2" valign="top">a</th>
      <th>1</th>
      <td>0.040243</td>
      <td>0.026031</td>
    </tr>
    <tr>
      <th>2</th>
      <td>0.448145</td>
      <td>0.356229</td>
    </tr>
    <tr>
      <th rowspan="2" valign="top">b</th>
      <th>1</th>
      <td>0.491886</td>
      <td>0.105252</td>
    </tr>
    <tr>
      <th>2</th>
      <td>0.516016</td>
      <td>0.271970</td>
    </tr>
  </tbody>
</table>
</div>

In [15]:
df = pd.Series({('CA', 2000): 1, ('CA', 2001): 2, ('TX', 2000): 3, ('TX', 2002): 4, ('NYC', 2005): 8})
df

CA   2000    1
     2001    2
NYC  2005    8
TX   2000    3
     2002    4
dtype: int64

In [27]:
df = pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])
print(df)
df = pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])
print(df)
df = pd.MultiIndex.from_product([['a', 'b'], [1, 2]])
print(df)
data = pd.Series(np.random.rand(4), index=df)
print(data)
print(data['a'])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])
MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])
MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])
a  1    0.527758
   2    0.186724
b  1    0.932946
   2    0.939352
dtype: float64
1    0.527758
2    0.186724
dtype: float64

# concat, join, merge, etc.

In [33]:
df1 = pd.DataFrame({1: 'a', 2: 'b', 3: 'c'}, index=[1, 2, 3])
print(df1)
df2 = pd.DataFrame({1: 'a1', 4: 'd'}, index=[4])
print(df2)
print(pd.concat([df1, df2]))
print(df1.append(df2))

   1  2  3
1  a  b  c
2  a  b  c
3  a  b  c
    1  4
4  a1  d
    1    2    3    4
1   a    b    c  NaN
2   a    b    c  NaN
3   a    b    c  NaN
4  a1  NaN  NaN    d
    1    2    3    4
1   a    b    c  NaN
2   a    b    c  NaN
3   a    b    c  NaN
4  a1  NaN  NaN    d

In [35]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Platform', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_year': [2004, 2008, 2012, 2014]})
print(df1)
print(df2)
print(pd.merge(df1, df2))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa     Platform
3      Sue           HR
  employee  hire_year
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_year
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa     Platform       2004
3      Sue           HR       2014

In [40]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Platform', 'HR']})
df2 = pd.DataFrame({'name': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_year': [2004, 2008, 2012, 2014]})
print(df1)
print(df2)
print(pd.merge(df1, df2, left_on='employee', right_on='name'))
df1.set_index('employee')
df2.set_index('name')
print(pd.merge(df1, df2, left_index=True, right_index=True))
print(df1.join(df2))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa     Platform
3      Sue           HR
   hire_year  name
0       2004  Lisa
1       2008   Bob
2       2012  Jake
3       2014   Sue
  employee        group  hire_year  name
0      Bob   Accounting       2008   Bob
1     Jake  Engineering       2012  Jake
2     Lisa     Platform       2004  Lisa
3      Sue           HR       2014   Sue
  employee        group  hire_year  name
0      Bob   Accounting       2004  Lisa
1     Jake  Engineering       2008   Bob
2     Lisa     Platform       2012  Jake
3      Sue           HR       2014   Sue
  employee        group  hire_year  name
0      Bob   Accounting       2004  Lisa
1     Jake  Engineering       2008   Bob
2     Lisa     Platform       2012  Jake
3      Sue           HR       2014   Sue

# Group by, aggregation, filter, etc.

In [42]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['a', 'b', 'c', 'a', 'b', 'c'], 'data1': range(6), 'data2': rng.randint(0, 10, 6)}, columns=['key', 'data1', 'data2'])
print(df)

  key  data1  data2
0   a      0      5
1   b      1      0
2   c      2      3
3   a      3      3
4   b      4      7
5   c      5      9

In [43]:
df.groupby('key').aggregate(['min', np.median, max])

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr>
      <th></th>
      <th colspan="3" halign="left">data1</th>
      <th colspan="3" halign="left">data2</th>
    </tr>
    <tr>
      <th></th>
      <th>min</th>
      <th>median</th>
      <th>max</th>
      <th>min</th>
      <th>median</th>
      <th>max</th>
    </tr>
    <tr>
      <th>key</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>0</td>
      <td>1.5</td>
      <td>3</td>
      <td>3</td>
      <td>4.0</td>
      <td>5</td>
    </tr>
    <tr>
      <th>b</th>
      <td>1</td>
      <td>2.5</td>
      <td>4</td>
      <td>0</td>
      <td>3.5</td>
      <td>7</td>
    </tr>
    <tr>
      <th>c</th>
      <td>2</td>
      <td>3.5</td>
      <td>5</td>
      <td>3</td>
      <td>6.0</td>
      <td>9</td>
    </tr>
  </tbody>
</table>
</div>

In [44]:
df.groupby('key').transform(lambda x: x - x.mean())

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>data1</th>
      <th>data2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>-1.5</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>-1.5</td>
      <td>-3.5</td>
    </tr>
    <tr>
      <th>2</th>
      <td>-1.5</td>
      <td>-3.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1.5</td>
      <td>-1.0</td>
    </tr>
    <tr>
      <th>4</th>
      <td>1.5</td>
      <td>3.5</td>
    </tr>
    <tr>
      <th>5</th>
      <td>1.5</td>
      <td>3.0</td>
    </tr>
  </tbody>
</table>
</div>